sphereAndBackground/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
 // large domain
    (-0.5 -0.5 -0.8)
    (0.5 -0.5 -0.8)
    (0.5  0.5 -0.8)
    (-0.5  0.5 -0.8)
    (-0.5 -0.5 2.5)
    (0.5 -0.5 2.5)
    (0.5 0.5 2.5)
    (-0.5  0.5 2.5)

);

blocks
(
// large domain block
    hex (0 1 2 3 4 5 6 7) (50 50 100) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    wall
    {
        type patch;
        faces
        (
            
	    (2 6 5 1)
	    (0 4 7 3)
	    (3 7 6 2)
        (1 5 4 0)
	    
        );
    }
    inlet
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

	    
   
  
);



