sphereAndBackground/system/maxCo
maxCo           0.01;
