sphereAndBackground/system/maxCo0.04
maxCo           0.04;
